//
//  requirements.h
//  ProjectB
//
//  Created by Chris on 16/7/29.
//  Copyright © 2016年 0403ClassTeam02. All rights reserved.
//



//项目需求声明文档

/*
 需求:
            本App是一个休闲类App, 功能是为了用户在户外活动的时候可以为用户提供解闷, 本App具有4个页面(暂定)
 
            第一个页面(主页)拍照分享(需要动用摄像头功能), 可添加步数和当前位置等信息, 并且可以书写编辑分享
 
            第二个页面为阅读资讯, 可提供书刊小说等文字类信息阅览功能的一个界面(界面可以做得有书架一样的视觉效果)
 
            第三个电台音乐页面, 可以提供收听电台信息音乐等资讯(可后台播放)
 
            
            第四个页面为计步器功能页面, 为用户提供可以获取当前GPS地理位置和当天一共走了多少步的一个功能页面, 需要能存储之前走过的总步数.
 
            本App尽量以轻量化设置为标准, 界面风格尽量以飒爽、清晰、柔和、大自然与一体
 
 
 
 */



